m0lomalteser/Flipper-Zero-ESP32-Port/sdkconfig.defaults
# Target: ESP32-C6 (RISC-V, for Waveshare ESP32-C6-LCD-1.9)
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_singleapp_large.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp_large.csv"

# Bluetooth Low Energy for Bad USB BLE HID
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set

# FreeRTOS configuration for Furi compatibility
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=3
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Heap
CONFIG_HEAP_TRACING_OFF=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Task watchdog: generous timeout (PHY calibration on first boot can take 15-20s)
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Interrupt watchdog: disabled — first PHY calibration (>15s) fires TG0WDT
# and creates a boot loop before calibration completes.
# CONFIG_ESP_INT_WDT is not set

# System
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# TinyUSB: disable MSC (no callback implementations provided)
# CONFIG_TINYUSB_MSC_ENABLED is not set

# FAT filesystem: enable Long File Names (stored on heap)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# NFC needs 3DES (felica, mf_ultralight)
CONFIG_MBEDTLS_DES_C=y

# WiFi "Update SD": HTTPS-Download ohne Server-Zertifikatsprüfung erlauben
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
# mbedTLS-Allokationen ins PSRAM (interner DRAM reicht mit WiFi nicht für den
# TLS-Handshake → sonst -0x7F00/-0x2880). Langsamer als intern, aber stabil;
# DYNAMIC_BUFFER + SPIRAM_TRY_ALLOCATE_WIFI_LWIP crashen den WiFi-Treiber.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
